src/cf/AccumulationRegisters/ДвиженияСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияСерииНоменклатуры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииСерийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ОперацииСерийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииСерийНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Движение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/AccumulationRegisters/ДвиженияСерииНоменклатуры/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыОбщийИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыОбщийИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыОбщийИзменение Тогда
				
		// Если временная таблица "ДвиженияСерииНоменклатурыОбщийИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияСерииНоменклатурыОбщийПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СерииНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	СерииНоменклатуры.Номенклатура КАК Номенклатура,
		|	СерииНоменклатуры.Характеристика КАК Характеристика,
		|	СерииНоменклатуры.Серия КАК Серия,
		|	СерииНоменклатуры.Операция КАК Операция
		|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыОбщийПередЗаписью
		|ИЗ
		|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияСерииНоменклатурыОбщийИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблицу "ДвиженияСерииНоменклатурыОбщийПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияСерииНоменклатурыОбщийИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСерииНоменклатурыОбщийИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияСерииНоменклатурыОбщийИзменение.Характеристика КАК Характеристика,
		|	ДвиженияСерииНоменклатурыОбщийИзменение.Серия КАК Серия,
		|	ДвиженияСерииНоменклатурыОбщийИзменение.Операция КАК Операция
		|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыОбщийПередЗаписью
		|ИЗ
		|	ДвиженияСерииНоменклатурыОбщийИзменение КАК ДвиженияСерииНоменклатурыОбщийИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДвиженияСерииНоменклатурыОбщий.НомерСтроки,
		|	ДвиженияСерииНоменклатурыОбщий.Номенклатура,
		|	ДвиженияСерииНоменклатурыОбщий.Характеристика,
		|	ДвиженияСерииНоменклатурыОбщий.Серия,
		|	ДвиженияСерииНоменклатурыОбщий.Операция
		|ИЗ
		|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатурыОбщий
		|ГДЕ
		|	ДвиженияСерииНоменклатурыОбщий.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияСерииНоменклатурыОбщийИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыОбщийИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыОбщийИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияСерииНоменклатурыОбщийИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Регистратор = Отбор.Регистратор.Значение;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЧекККМ")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "Архивный") Тогда
		// Движения чека ККМ не исчезают бесследно, они переносятся в Отчет о розничных продажах.
		// В связи с этим, не следует обновлять флаги партий. Они обновятся при формировании движений ОРП.
		// Может оказаться, что в ОРП есть и приход и расход этой серии, и тогда следует оставить флаг неизменным.
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияЗапасыНаСкладахИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДвиженияСерииНоменклатурыОбщийПередЗаписью.Номенклатура КАК Номенклатура,
	|	ДвиженияСерииНоменклатурыОбщийПередЗаписью.Характеристика КАК Характеристика,
	|	ДвиженияСерииНоменклатурыОбщийПередЗаписью.Операция КАК Операция,
	|	ДвиженияСерииНоменклатурыОбщийПередЗаписью.Серия КАК Серия,
	|	-1 КАК ВидИзменения
	|ПОМЕСТИТЬ вт_ИзменениеДвижений
	|ИЗ
	|	ДвиженияСерииНоменклатурыОбщийПередЗаписью КАК ДвиженияСерииНоменклатурыОбщийПередЗаписью
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияСерииНоменклатурыОбщий.Номенклатура,
	|	ДвиженияСерииНоменклатурыОбщий.Характеристика,
	|	ДвиженияСерииНоменклатурыОбщий.Операция,
	|	ДвиженияСерииНоменклатурыОбщий.Серия,
	|	1
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатурыОбщий
	|ГДЕ
	|	ДвиженияСерииНоменклатурыОбщий.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Характеристика КАК Характеристика,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Операция КАК Операция,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Серия КАК Серия,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Серия.Продан КАК СерияПродан,
	|	ПараметрыПодарочногоСертификата.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат) КАК СертификатСПовторнойАктивацией,
	|	ПараметрыПодарочногоСертификата.ИспользоватьУникальныеСерии КАК ИспользоватьУникальныеСерии,
	|	СУММА(ДвиженияСерииНоменклатурыОбщийИзменение.ВидИзменения) КАК ВидИзменения
	|ИЗ
	|	вт_ИзменениеДвижений КАК ДвиженияСерииНоменклатурыОбщийИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ПараметрыПодарочногоСертификата
	|		ПО ДвиженияСерииНоменклатурыОбщийИзменение.Номенклатура = ПараметрыПодарочногоСертификата.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Номенклатура,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Характеристика,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Операция,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Серия,
	|	ДвиженияСерииНоменклатурыОбщийИзменение.Серия.Продан,
	|	ПараметрыПодарочногоСертификата.ТипНоменклатуры,
	|	ПараметрыПодарочногоСертификата.ИспользоватьУникальныеСерии,
	|	ПараметрыПодарочногоСертификата.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияСерииНоменклатурыОбщийИзменение.ВидИзменения) <> 0");
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СчетчикДвиженийСерии = Новый Соответствие();
	ТекущееСостояниеФлагаСерии = Новый Соответствие();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		Если НЕ ВыборкаИзРезультатаЗапроса.ИспользоватьУникальныеСерии Тогда
			Продолжить;
		КонецЕсли;
		Если ДополнительныеСвойства.ДляПроведения.Свойство("РежимЗаписи") Тогда
			
			Если ДополнительныеСвойства.ДляПроведения.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Если ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Расход Тогда
					
					Если Не ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
						И Не ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ПеремещениеПоЯчейкам") Тогда
						УстановитьСостояниеПродан = Истина;
					КонецЕсли;
					
				ИначеЕсли ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Приход Тогда
					
					Если ВыборкаИзРезультатаЗапроса.СертификатСПовторнойАктивацией Тогда
						УстановитьСостояниеПродан = Ложь;
					Иначе
				    	УстановитьСостояниеПродан = Неопределено;
					КонецЕсли;

				ИначеЕсли ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Возврат Тогда
					
					УстановитьСостояниеПродан = Ложь;
					
				КонецЕсли;
			ИначеЕсли ДополнительныеСвойства.ДляПроведения.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Если ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Расход Тогда
				
					УстановитьСостояниеПродан = Ложь;
					
				ИначеЕсли ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Приход 
					И ВыборкаИзРезультатаЗапроса.СертификатСПовторнойАктивацией Тогда
					
					УстановитьСостояниеПродан = Ложь;
				
				ИначеЕсли ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Приход Тогда
					
					УстановитьСостояниеПродан = Неопределено;
					
				ИначеЕсли ВыборкаИзРезультатаЗапроса.Операция = Перечисления.ОперацииСерийНоменклатуры.Возврат Тогда	
					
					УстановитьСостояниеПродан = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НаправлениеСчетчика = 0;
		Если УстановитьСостояниеПродан = Истина Тогда
			НаправлениеСчетчика = 1;
		ИначеЕсли УстановитьСостояниеПродан = Ложь Тогда
			НаправлениеСчетчика = -1;
		КонецЕсли;
		ТекущееСостояниеСчетчика = СчетчикДвиженийСерии.Получить(ВыборкаИзРезультатаЗапроса.Серия);
		Если ТекущееСостояниеСчетчика = Неопределено Тогда
			ТекущееСостояниеСчетчика = 0;
		КонецЕсли;
		НовоеСостояниеСчетчика = ТекущееСостояниеСчетчика + НаправлениеСчетчика;
		Если НовоеСостояниеСчетчика = 0 Тогда
			СчетчикДвиженийСерии.Удалить(ВыборкаИзРезультатаЗапроса.Серия);
		Иначе
			СчетчикДвиженийСерии[ВыборкаИзРезультатаЗапроса.Серия] = НовоеСостояниеСчетчика;
		КонецЕсли;
		ТекущееСостояниеФлагаСерии[ВыборкаИзРезультатаЗапроса.Серия] = ВыборкаИзРезультатаЗапроса.СерияПродан;
	КонецЦикла;
	
	// Некоторые документы могут одновременно и приходовать и списывать серию. 
	// В этом случае, считаем что состояние партии не изменилось.
	Для Каждого СчетчикДвиженийТекущейСерии Из СчетчикДвиженийСерии Цикл
		ТекущаяСерия = СчетчикДвиженийТекущейСерии.Ключ;
		СерияПродан = ТекущееСостояниеФлагаСерии[ТекущаяСерия] ;
		УстановитьСостояниеПродан = Неопределено;
		СчетчикСерии = СчетчикДвиженийТекущейСерии.Значение;
		Если СчетчикСерии > 0 Тогда
			УстановитьСостояниеПродан = Истина;
		ИначеЕсли СчетчикСерии < 0 Тогда
			УстановитьСостояниеПродан = Ложь;
		КонецЕсли;
		Если УстановитьСостояниеПродан <> Неопределено 
			И УстановитьСостояниеПродан <> СерияПродан Тогда
			СерияОбъект = ТекущаяСерия.ПолучитьОбъект();
			СерияОбъект.Продан = УстановитьСостояниеПродан;
			СерияОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Новые изменения были помещены во временную таблицу "ДвиженияСерииНоменклатурыОбщийИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	
	// Временная таблица "ДвиженияЗапасыНаСкладахПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыОбщийПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
